/*
 * File:   main.h
 * Author: User
 *
 * Created on 18 сентября 2019 г., 13:05
 */

// Блокируем повторное включение этого модуля 
#ifndef _STM32_H
#define	_STM32_H

  //****************************************************************************** 
  //  Секция include: здесь подключаются заголовочные файлы используемых модулей 
  //****************************************************************************** 
#include <stdint.h>
#include "stm32f030x6.h"
#include "system_stm32f0xx.h"
#include "stm32f0xx.h"
#include "stm32f0xx_const.h"
#include "RCC_HSI_48_Init.h"
#include "Timers.h"


  //****************************************************************************** 
  //  Секция определения констант 
  //****************************************************************************** 
  //#define MY_CONST1            1 
  //#define MY_CONST2            2 
  //#define ... 

  //****************************************************************************** 
  //  Секция определения типов 
  //****************************************************************************** 
  //typedef struct  
  //{ 
  //    ... 
  //} T_STRUCT; 

  //typedef ... 

  //****************************************************************************** 
  //  Секция определения глобальных переменных 
  //****************************************************************************** 
  //extern char GlobalVar1; 
  //extern char GlobalVar2; 
  //****************************************************************************** 
  //  Секция прототипов глобальных функций 
  //****************************************************************************** 
  //void global_func1 (void); 
  //void global_func2 (void); 
  //****************************************************************************** 
  //  Секция определения макросов 
  //****************************************************************************** 
  //#define MACRO1    M1
  //#define MACRO2    M2

// Закрывающий #endif к блокировке повторного включения 
#endif	/* MAIN_H */

//****************************************************************************** 
//  ENF OF FILE 
//****************************************************************************** /* 
